[
  {
    "path": "posts/welcome/",
    "title": "Welcome to Marionomics",
    "description": "Bienvenidos a mi blog. Estoy haciendo cambios actualmente. ¿Cómo se ve?",
    "author": [
      {
        "name": "Mario",
        "url": "https://marionomics.com/about"
      }
    ],
    "date": "2020-12-23",
    "categories": [],
    "contents": "\n\n\n\n",
    "preview": {},
    "last_modified": "2020-12-23T14:09:29-06:00",
    "input_file": "welcome.utf8.md"
  },
  {
    "path": "posts/2020-12-23-cmo-calcular-el-tamao-de-muestra-en-r/",
    "title": "Como calcular el tamaño de muestra en R",
    "description": "Descripción y código",
    "author": [
      {
        "name": "Mario Alberto García-Meza",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2020-12-23",
    "categories": [],
    "contents": "\nLa base de la estadística inferencial es, como su nombre lo indica, obtener inferencias de una población a partir de una muestra. Normalmente es una cuestión de administración de recursos escasos lo que nos obliga a hacerlo de esta manera, por lo que una pregunta razonable en un experimento o en un estudio es ¿De qué tamaño es la muestra que se necesita?.\nUna muestra más grande genera resultados más precisos, pero esto naturalmente incrementa los costos de operación, que vienen por el tiempo, el trabajo y el dinero que se debe invertir a la recolección de la información. Por el otro lado, si un tamaño de muestra es demasiado pequeña, los resultados pierden confiabilidad.\nPara calcular el tamaño de muestra, es necesario conocer cuatro cosas\nEl tamaño de la respuesta que quieres detectar\nLa varianza de la respuesta\nLos niveles de significancia deseados\nel poder deseado\nAl tamaño de la respuesta se le puede llamar delta y se refiere a la diferencia entre los grupos de tratamiento y de control en un experimento. Definamos \\(\\Delta = \\mu_1-\\mu_2\\), donde \\(\\mu_1\\) representa a el grupo de tratamiento y \\(\\mu_2\\) es el grupo de control. Entonces entre más pequeña la diferencia que se está buscando detectar, más grande tiene que ser el tamaño de la muestra para poderlo encontrar.\nEl segundo punto es la varianza. Es el ruido que tiene nuestra información. Entre más grande sea el ruido, más grande tiene que ser el tamaño de la muestra para poder identificar las diferencias que se capturan en \\(\\Delta\\).\nDefinamos la varianza como \\(\\sigma^2\\), que nos ayuda a identificar el mencionado ruido. Entonces el tamaño del efecto combina la diferencia con la varianza y lo podemos definir con \\(\\Delta/\\sigma^2\\).\nDefinamos como \\(\\alpha\\) la probabilidad de tener un error de tipo 1, es decir, que rechacemos nuestra hipótesis nula de manera falsa, o tengamos un falso positivo. El valor de \\(\\alpha\\) se fija regularmente en 0.05, para alcanzar una significancia de 95%.\nFinalmente, tenemos que definir el poder de nuestra prueba, que definimos con \\(1-\\beta\\) donde \\(\\beta\\) representa la probabilidad de no rechazar la hipótesis nula cuando la hipótesis alternativa es verdadera (error tipo 2). Si, por ejemplo, tienes un 20% de no detectar una diferencia que es real, entonces el poder de tu prueba es de 0.8.\nCálculo del tamaño de la muestra\nEl cálculo del tamaño total de la muestra es\n\\[\\begin{equation}\n  n = \\frac{4(Z_\\alpha + Z_\\beta)^2\\sigma^2}{\\Delta^2}\n\\end{equation}\\]\nsólo cambiando \\(Z_{\\alpha}\\) por \\(Z_{\\alpha/2}\\) si la prueba es de dos lados.\nPor ejemplo, imaginemos que el tamaño de la diferencia que queremos estimar es de 20 unidades, con un poder de 90% en una prueba de dos lados con un nivel de significancia de 0.05. Investigaciones previas nos indican que la desviación estándar \\(\\sigma\\) es de alrededor de 60 unidades. Entonces\n\\[\\begin{equation}\n  n = \\frac{4(1.96 + 1.28)^2\\sigma^2}{20^2} \\approx 378\n\\end{equation}\\]\no aproximadamente 189 para cada uno de los dos grupos de tratamiento.\nCálculo en R\nLa función pwr.t.test() de la librería pwr en R está diseñada para realizar el cálculo del tamaño de muestra que nosotros buscamos.\nEsta función nos sirve para calcular el valor de nuestro estadístico \\(t\\) en función del tamaño de la muestra, pero si, en lugar de eso dejamos el parámetro \\(n\\) sin aplicar en la función, esta nos va a regresar nuestro tamaño de muestra. Veamos cómo se vería el ejemplo que hicimos anteriormente\n\n\ndelta <- 20\nsigma <- 60\nd <- delta/sigma\n\npwr::pwr.t.test(d = d,\n                sig.level = 0.5,\n                power = .90,\n                type = 'two.sample')\n\n\n\n     Two-sample t test power calculation \n\n              n = 67.18309\n              d = 0.3333333\n      sig.level = 0.5\n          power = 0.9\n    alternative = two.sided\n\nNOTE: n is number in *each* group\n\n\n\n\n",
    "preview": {},
    "last_modified": "2020-12-23T14:23:08-06:00",
    "input_file": "cmo-calcular-el-tamao-de-muestra-en-r.utf8.md"
  },
  {
    "path": "posts/2020-12-23-tamaos-de-muestra-para-una-encuesta/",
    "title": "Tamaños de muestra para una encuesta",
    "description": "Cómo obtener el tamaño de muestra.",
    "author": [
      {
        "name": "Mario A. García-Meza",
        "url": "https://marionomics.com/blog"
      }
    ],
    "date": "2020-12-23",
    "categories": [],
    "contents": "\nEn un post anterior hablamos sobre cómo obtener el tamaño de muestra cuando hacemos un experimento. En economía también es importante conocer esto cuando hacemos RCTs o estudios expemimentales, pero en ocasiones queremos saber el tamaño de nuestra muestra en función del tamaño de la población.\nEste tipo de inferencia es importante, pues nos ayuda a conocer el tamaño que necesitamos al momento de diseñar una encuesta. Digamos que queremos conocer algo relacionado al municipio de Durango, Durango, México. De acuerdo al INEGI, en la encuesta intercensal 2015, Durango tiene 654,876 habitantes. Esto lo definimos como \\(N\\) y lo incluimos en nuestra fórmula\n\\[\\begin{equation}\nn = \\frac{\\frac{z^2 \\times p (1-p)}{e^2}}{1 + \\frac{z^2\\times p(1-p)}{e^2 N}}\n\\end{equation}\\]\ndonde \\(e\\) es el margen de error y \\(z\\) es el z-score, el número de desviaciones estándar que una proporción dada se desvía de la media. La siguiente tabla tiene una serie de puntajes z para elegir, según el nivel de confianza deseado.\nNivel de confianza deseado\nz-score\n80%\n1.28\n85%\n1.44\n90%\n1.65\n95%\n1.96\n99%\n2.58\nEl margen de error se estima como\n\\[\\begin{equation}\n  e = z \\times \\frac{\\sigma}{n},\n\\end{equation}\\]\nlo cual hace esta exposición un tanto circular porque aquí necesitaríamos del tamaño de la muestra. Un estándar es aceptar un margen de error de 5% si no se tiene más información.\nHagamos entonces una función que nos regrese el z-score al entregarle el intervalo de confianza\n\n\nz_score <- function(intervalo_de_confianza){\n  if (intervalo_de_confianza == .8){return(1.28)}\n  else if(intervalo_de_confianza == .85){return(1.44)}\n  else if(intervalo_de_confianza == .90){return(1.65)}\n  else if(intervalo_de_confianza == .95){return(1.96)}\n  else if(intervalo_de_confianza == .99){return(2.58)}\n  else return(NA)\n}\n\n\n\nSin embargo, la fórmula de arriba no es necesaria, pues R cuenta con la función qnorm() que nos ayuda a obtener nuestros niveles de z bajo el supuesto de normalidad. Hagamos una función en R que nos genere nuestro tamaño de muestra entonces bajo este supuesto. Pongamos el margen de error con valor de 0.5 por default y el intervalo de confianza con valor 0.05 también por default. Esto nos permitirá no tener que establecer tantos parámetros al llamar la función, si es que no tenemos que especificar estos valores.\n\n\nsample.size = function(c.lev, margin=.5,\n                       c.interval=.05, population) {\n  z.val = qnorm(.5+c.lev/200)\n  ss = (z.val^2 * margin * (1-margin))/c.interval^2\n  p.ss = round((ss/(1 + ((ss-1)/population))), digits=0)\n  METHOD = paste(\"Tama<U+00F1>o de muestra recomendado para una poblacion de  \"NApopulation, \" a un \", c.lev,\n                 \"% de nivel de confianza\", sep = \"\")\n  structure(list(Population = population,\n                 \"Nivel de confianza\" = c.lev,\n                 \"Margen de error\" = c.interval,\n                 \"Distribuci<U+00F3>n de la respuesta\"i=,marginNA\"Tama<U+00F1>o de muestra recomendado\",=NAp.ssNA= METHOD),\n            class = \"power.htest\")\n}\n\n\n\nAhora vamos a llamar la función con nuestros niveles de confianza y la población que hemos establecido\n\n\n     Tama<U+00F1>o de muestra recomendado para una poblacion de  654876 a un 95% de nivel de confianza \n\n                          Population = 654876\n                  Nivel de confianza = 95\n                     Margen de error = 0.05\n Distribuci<U+00F3>n de la respuesta = 0.5\nTama<U+00F1>o de muestra recomendado = 384\n\nEl resultado es sorprendentemente pequeño. Sólamente se necesitan 384 encuestas. Sin embargo, esta respuesta tiene un problema: estamos asumiendo que toda la población de Durango es completamente homogénea y con distribución normal. Pero como nosotros sabemos, las poblaciones en las ciudades no tienen ese beneficio.\nPor eso tenemos que tener cuidado con nuestros supuestos. Esto lo veremos en próximos posts.\n\n\n\n",
    "preview": {},
    "last_modified": "2020-12-23T16:57:40-06:00",
    "input_file": "tamaos-de-muestra-para-una-encuesta.utf8.md"
  }
]
